            SELECT LOCATION-FILE  ASSIGN TO 'LOC.DAT'
            ORGANIZATION IS INDEXED
            ACCESS IS DYNAMIC
            RECORD KEY IS LOC-CODE
            ALTERNATE RECORD KEY IS LOC-CITY.

